[{
        "name": "shibe.host",
        "title": "shibe.host - a private file uploading service",
        "date": "2021-04-03T00:00:00.000Z",
        "excerpt": "shibe.host is a private file uploading service, primarily focused on embeddable images to be used on Discord. The backend runs on Nodejs + Express, while the frontend was made using SvelteKit.",
        "images": ["/images/shibe.host.png", "/images/shibe.host1.png", "/images/shibe.host2.png"],
        "link": "https://shibe.host",
        "tags": [
            "NodeJS",
            "ExpressJS",
            "SvelteKit",
            "MongoDB",
            "Tailwind"
        ],
        "long_text": "shibe.host is a file uploading service I made using a highly customized version of <a href='https://github.com/tycrek/ass'>ASS (A Selfhosted ShareX Server) to handle file uploads, and a frontend written with SvelteKit. The site is private by design, with an invite key system that people can use to invite their friends. I learned a lot about properly handing REST routes as well as learning how to work with SvelteKit to create a SSR app.</a>"
    },
    {
        "name": "arlan",
        "title": "Arlan - a cryptocurrency webshop",
        "date": "2021-04-03T00:00:00.000Z",
        "excerpt": "Arlan was a college assignment which tasked us with designing and developing a webshop that does something unique.",
        "images": ["/images/arlan.png", "/images/arlan1.png"],
        "gh_link": "https://github.com/pgmgent-pgm-4/webshop-arlan",
        "tags": [
            "NodeJS",
            "ExpressJS",
            "PassportJS",
            "Sequelize",
            "Jest"
        ],
        "finished": true,
        "long_text": "Arlan is a cryptocurrency webshop I made for Arteveldehogeschool in collaberation with Arthur Temmerman. The goal of the site was to rethink how webshops are made, specifically in this case cryptocurrency platforms. We wanted to design a system that made it easier for new people to invest, or buy cryptocurrency by not working like a crypto exchange, but rather a crypto webshop. This is accomplished by only allowing the user to buy with set amounts of their currency in exchange for the set amount of crypto."
    },
    {
        "name": "movc",
        "title": "{MovC} - a movie/show database",
        "date": "2021-04-03T00:00:00.000Z",
        "excerpt": "MovieCollection is a React app utilizing TheMovieDatbase's API to show the last movies and shows.",
        "gh_link": "https://github.com/pgmgent-pgm-4/movie-application-dylancl",
        "images": ["/images/moviecollection.png", "/images/moviecollection1.png", "/images/moviecollection2.png"],
        "tags": [
            "ReactJS",
            "firebase",
            "Jest",
            "Storybook",
            "Sass"
        ],
        "finished": true,
        "long_text": "{MovC} (read: MovieCollection) is a project for Arteveldehogeschool where the task was to create a visually appealing movie database, along the likes of IMDB and Rotten Tomatoes. I decided to go for a dashboard-like appearance emulating a site like Netflix allowing for an easy & intiutive way of browsing the database. The site was deployed to Firebase using GitHub actions, and uses Firestore for user authentication."
    }
]